export const MUNICIPALITIES_DATA: Record<string, string[]> = {
  "三重": [
    "四日市市",     "津市",     "鈴鹿市",     "松阪市",
  ],
  "京都": [
    "京都市中京区",     "京都市下京区",     "京都市東山区",     "京都市左京区",
    "宇治市",     "舞鶴市", 
  ],
  "佐賀": [
    "佐賀市",     "唐津市", 
  ],
  "兵庫": [
    "神戸市中央区",     "神戸市兵庫区",     "西宮市",     "尼崎市",
    "姫路市",     "明石市",     "加古川市",     "宝塚市",
  ],
  "北海道": [
    "札幌市中央区",     "札幌市北区",     "札幌市すすきの",     "旭川市",
    "函館市",     "小樽市",     "釧路市",     "苫高牧市",
    "帯広市", 
  ],
  "千葉": [
    "千葉市中央区",     "船橋市",     "市川市",     "松戸市",
    "柏市",     "浦安市",     "成田市",     "市原市",
  ],
  "和歌山": [
    "和歌山市",     "田辺市",     "紀の川市", 
  ],
  "埼玉": [
    "さいたま市",     "川口市",     "川越市",     "越谷市",
    "草加市",     "所沢市",     "上尾市",     "北本市",
    "熊谷市", 
  ],
  "大分": [
    "大分市",     "別府市",     "中津市", 
  ],
  "大阪": [
    "大阪市北区",     "大阪市中央区",     "大阪市淀川区",     "大阪市天王寺区",
    "堺市",     "東大阪市",     "豊中市",     "吹田市",
    "高槻市",     "枚方市",     "八尾市",     "寝屋川市",
  ],
  "奈良": [
    "奈良市",     "橿原市",     "生駒市", 
  ],
  "宮城": [
    "仙台市青葉区",     "仙台市宮城野区",     "仙台市若林区",     "石巻市",
    "大崎市",     "名取市", 
  ],
  "宮崎": [
    "宮崎市",     "都城市",     "延岡市", 
  ],
  "富山": [
    "富山市",     "高岡市",     "魚津市",     "氷見市",
    "滑川市",     "黒部市",     "砺波市",     "小矢部市",
    "南砺市",     "射水市", 
  ],
  "山口": [
    "下関市",     "山口市",     "宇部市",     "周南市",
  ],
  "山形": [
    "山形市",     "米沢市",     "鶴岡市",     "酒田市",
    "新庄市",     "寒河江市",     "上山市",     "村山市",
    "長井市",     "天童市",     "東根市",     "尾花沢市",
    "南陽市", 
  ],
  "山梨": [
    "甲府市",     "富士吉田市",     "笛吹市", 
  ],
  "岐阜": [
    "岐阜市",     "大垣市",     "各務原市",     "多治見市",
  ],
  "岡山": [
    "岡山市北区",     "倉敷市",     "津山市", 
  ],
  "岩手": [
    "盛岡市",     "宮古市",     "大船渡市",     "花巻市",
    "北上市",     "久慈市",     "遠野市",     "一関市",
    "陸前高田市",     "釜石市",     "二戸市",     "八幡平市",
    "奥州市",     "滝沢市", 
  ],
  "島根": [
    "松江市",     "浜田市",     "出雲市",     "益田市",
    "大田市",     "安来市",     "江津市",     "雲南市",
  ],
  "広島": [
    "広島市中区",     "広島市南区",     "福山市",     "呉市",
    "東広島市",     "尾道市", 
  ],
  "徳島": [
    "徳島市",     "阿南市", 
  ],
  "愛媛": [
    "松山市",     "今治市",     "新居浜市", 
  ],
  "愛知": [
    "名古屋市中区",     "名古屋市中村区",     "名古屋市東区",     "名古屋市熱田区",
    "一宮市",     "豊橋市",     "岡崎市",     "豊田市",
    "春日井市",     "安城市", 
  ],
  "新潟": [
    "新潟市",     "長岡市",     "三条市",     "柏崎市",
    "新発田市",     "小千谷市",     "加茂市",     "十日町市",
    "見附市",     "村上市",     "燕市",     "糸魚川市",
    "妙高市",     "五泉市",     "上越市",     "阿賀野市",
    "佐渡市",     "魚沼市",     "南魚沼市",     "胎内市",
  ],
  "東京": [
    "新宿区",     "渋谷区",     "港区",     "中央区",
    "豊島区",     "台東区",     "品川区",     "目黒区",
    "世田谷区",     "中野区",     "杉並区",     "北区",
    "荒川区",     "板橋区",     "練馬区",     "足立区",
    "葛飾区",     "江戸川区",     "八王子市",     "立川市",
    "武蔵野市",     "町田市", 
  ],
  "栃木": [
    "宇都宮市",     "小山市",     "足利市",     "栃木市",
  ],
  "沖縄": [
    "那覇市",     "沖縄市",     "宜野湾市",     "浦添市",
  ],
  "滋賀": [
    "大津市",     "草津市",     "彦根市", 
  ],
  "熊本": [
    "熊本市中央区",     "八代市",     "玉名市", 
  ],
  "石川": [
    "金沢市",     "七尾市",     "小松市",     "輪島市",
    "珠洲市",     "加賀市",     "羽咋市",     "かほく市",
    "白山市",     "能美市",     "野々市市", 
  ],
  "神奈川": [
    "横浜市",     "川崎市",     "相模原市",     "厚木市",
    "大和市",     "海老名市",     "藤沢市",     "鎌倉市",
    "横須賀市",     "平塚市",     "茅ヶ崎市", 
  ],
  "福井": [
    "福井市",     "敦賀市",     "小浜市",     "大野市",
    "勝山市",     "鯖江市",     "あわら市",     "越前市",
    "坂井市", 
  ],
  "福岡": [
    "福岡市博多区",     "福岡市中央区",     "福岡市早良区",     "北九州市小倉北区",
    "久留米市",     "飯塚市",     "大牟田市", 
  ],
  "福島": [
    "福島市",     "会津若松市",     "郡山市",     "いわき市",
    "白河市",     "須賀川市",     "喜多方市",     "相馬市",
    "二本松市",     "田村市",     "南相馬市",     "伊達市",
    "本宮市", 
  ],
  "秋田": [
    "秋田市",     "能代市",     "横手市",     "大館市",
    "男鹿市",     "湯沢市",     "鹿角市",     "由利本荘市",
    "潟上市",     "大仙市",     "北秋田市",     "にかほ市",
    "仙北市", 
  ],
  "群馬": [
    "高崎市",     "前橋市",     "太田市",     "伊勢崎市",
    "桐生市", 
  ],
  "茨城": [
    "水戸市",     "つくば市",     "日立市",     "土浦市",
    "ひたちなか市", 
  ],
  "長崎": [
    "長崎市",     "佐世保市",     "諫早市", 
  ],
  "長野": [
    "長野市",     "松本市",     "上田市",     "佐久市",
  ],
  "青森": [
    "青森市",     "弘前市",     "八戸市",     "黒石市",
    "五所川原市",     "十和田市",     "三沢市",     "むつ市",
    "つがる市",     "平川市", 
  ],
  "静岡": [
    "静岡市葵区",     "静岡市清水区",     "浜松市中区",     "沼津市",
    "富士市",     "三島市", 
  ],
  "香川": [
    "高松市",     "丸亀市", 
  ],
  "高知": [
    "高知市",     "南国市", 
  ],
  "鳥取": [
    "鳥取市",     "米子市",     "倉吉市",     "境港市",
  ],
  "鹿児島": [
    "鹿児島市",     "霧島市",     "鹿屋市", 
  ],
};
